---
kind: method
id: M:Autodesk.Revit.DB.FormArray.ForwardIterator
source: html/8bc5330b-a4d3-0d88-a343-e9be04d33429.htm
---
# Autodesk.Revit.DB.FormArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual FormArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.